------------------------------------------------------------------------------------------------------------------------------
SPARQL results
------------------------------------------------------------------------------------------------------------------------------

Query A: 

SELECT ?name ?subcategory ?category ?brand
WHERE {
  ?item schema:brand ?brand .                   #Get the brand
  ?item schema:name ?name.                      #Get item name
  ?item schema:product ?subcategory.            #Get the category.

OPTIONAL {?subcategory rdfs:subClassOf ?category }    # if there exist subcategory, also get it.
  }

ORDER BY RAND()
LIMIT 1


Results: (one of possible results)

Name:  Nintendo Switch (neonblauw/neonrood) Animal Crossing: New Horizons-bundel
Category:  consoles
Subcategory:  nintendo-switch-bundles
Brand:  Nintendo

------------

Query B: 

SELECT ?name ?subcategory
WHERE {
  {
    #SAMPLE: We choose 1 item from each subcategory
    SELECT DISTINCT ?subcategory (SAMPLE(?item) AS ?sampleItem)
    WHERE {
    ?item schema:brand ?brand . #choose same brand
    ?item schema:name ?name .
    ?item schema:product ?subcategory .
    }
  GROUP BY ?subcategory
  }

  ?sampleItem schema:brand ?brand .
  ?sampleItem schema:name ?name .
  ?sampleItem schema:product ?subcategory .
  }
ORDER BY RAND()

Results: (one of possible results)

Name:  Beenband
subCategory:  consoles/accessories
Name:  Animal Crossing: New Horizons
subCategory:  games
Name:  Game Boy-posterset
subCategory:  merchandise/home-and-gifts
Name:  Kirby's Dream Buffet-sleutelhanger
subCategory:  merchandise/apparel
Name:  Kirby's Return to Dream Land Deluxe-muismat
subCategory:  franchises
Name:  Nintendo Switch (neonblauw/neonrood) Animal Crossing: New Horizons-bundel
subCategory:  consoles/nintendo-switch-bundles
Name:  Another Code: Recollection
subCategory:  new
Name:  Nintendo Switch met neonblauwe/neonrode Joy-Con-controllers
subCategory:  consoles/nintendo-switch-consoles

------------

Query C: 

SELECT ?brand (AVG(?price) AS ?averagePrice)
WHERE {
  ?item schema:brand ?brand .
  ?item schema:price ?price .
}
GROUP BY ?brand

Results:

Brand:  Nintendo
Average Price:  101.22698113207538

------------
Question D:
We only have one brand here, so we sort it according to its price.

Query D: 

SELECT ?item ?category ?price
WHERE {
  {
    #Here we choose a random category
    SELECT ?category
    WHERE {
      ?item schema:product ?category .
    }
    ORDER BY RAND()
    LIMIT 1
  }

  ?item schema:product ?category.    #Get all items within that category
  ?item schema:price ?price .

}
ORDER BY ?price   #sort by price

Results: (one of results, some of them can only be purchased by virtual currency, so their price is 0 here.)

category:  new
item:  https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315
price:  0.0
category:  new
item:  https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html
price:  39.99
category:  new
item:  https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106
price:  49.99
category:  new
item:  https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021
price:  59.99
category:  new
item:  https://store.nintendo.nl/nl/fae-farm-P00115
price:  59.99
category:  new
item:  https://store.nintendo.nl/nl/super-mario-rpg-70010000068684
price:  59.99
category:  new
item:  https://store.nintendo.nl/nl/pikmin-4-70010000005306
price:  59.99
category:  new
item:  https://store.nintendo.nl/nl/another-code-recollection-70010000072197
price:  59.99
category:  new
item:  https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396
price:  429.99

------------
We only have one brand Nintendo:

Query E: (send to https://query.wikidata.org/sparql)

SELECT ?property ?propertyLabel (SAMPLE(?value) as ?sampleValue) (SAMPLE(?valueLabel) as ?sampleValueLabel)
WHERE {
  wd:Q8093 ?property ?value.
  SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
  FILTER (?property IN (wdt:P154, wdt:P159, wdt:P169,  wdt:P452,  wdt:P1448))
  
  #Q8093: Nintendo
  #154: logo image
  #159: headquarters location
  #169: chief executive officer
  #452: industry
  #1448: official name
}
GROUP BY ?property ?propertyLabel

Results:

P154:'http://commons.wikimedia.org/wiki/Special:FilePath/Nintendo.svg',
P159: 'http://www.wikidata.org/entity/Q34600',
P169: 'http://www.wikidata.org/entity/Q52177144',
P452: 'http://www.wikidata.org/entity/Q941594',
P1448: 'Nintendo Co., Ltd.'

------------

Query F: 


SELECT DISTINCT ?name1 ?name2 ?price1 ?price2 ?category
WHERE {
    ?item1 schema:price ?price1.
    ?item2 schema:price ?price2.

    # recommand item with similar price:
    ?item1 schema:name ?name1.
    ?item2 schema:name ?name2.

    ?item1 schema:product ?category.
    ?item2 schema:product ?category.

    FILTER (ABS(?price1 - ?price2) <= 1)
}
ORDER BY RAND()
Limit 1

Results: (one of possible results)

item:  Pikmin 4
price:  59.99
category:  games
similar item:  Metroid Dread
With price:  59.99
With category:  games

------
------------

G Question: what are the price of Switch? list their prices from low to high.

Why this query would be valuable in a webshop setting, such as for semantic search or other applications:
Since the core of Nintendo game series is to have a Switch, this query allows you to get all the items that include a Switch, whether it's a single machine or an bundle. When users want to buy a switch, a very important factor that determines which one they buy is the price. Providing all the prices of the switches and their bundles will make it easy for them to check.

Query G: 

SELECT ?name  ?price
  WHERE {
    ?switch schema:product <https://store.nintendo.nl/nl/consoles/nintendo-switch-consoles>.
    ?switch schema:name ?name .
    ?switch schema:price ?price .
}
ORDER BY ?price   #sort by price


Results:

Name:  Nintendo Switch met neonblauwe/neonrode Joy-Con-controllers
Price:  299.99
Name:  Nintendo Switch – OLED-Model Mario Edition (rood)
Price:  349.99
Name:  Nintendo Switch - OLED-model (neonblauw/neonrood)
Price:  349.99
Name:  Nintendo Switch - OLED-model (wit)
Price:  349.99
Name:  Nintendo Switch – OLED Model Pokémon Scarlet & Violet Edition
Price:  359.99
Name:  Nintendo Switch™ – OLED-Model Splatoon 3 Edition
Price:  359.99
Name:  Nintendo Switch – OLED-model The Legend of Zelda: Tears of the Kingdom Edition 
Price:  359.99

-----------------------------------------------------------------------------------------------------------------------------

