------------------------------------------------------------------------------------------------------------------------------
SPARQL results
------------------------------------------------------------------------------------------------------------------------------

Query A: 

SELECT ?name ?subcategory ?category ?brand
WHERE {
  ?item schema:brand ?brand .                   #Get the brand
  ?item schema:name ?name.                      #Get item name
  ?item schema:isVariantOf ?subcategory.            #Get the category.

OPTIONAL {?subcategory rdfs:subClassOf ?category }    # if there exist subcategory, also get it.
  }

ORDER BY RAND()
LIMIT 1


Results: (one of possible results)

Name:  Nintendo Switch (neonblauw/neonrood) Animal Crossing: New Horizons-bundel
Category:  consoles
Subcategory:  nintendo-switch-bundles
Brand:  Nintendo

------------

Query B: 

SELECT ?name ?subcategory
WHERE {
  {
    #SAMPLE: We choose 1 item from each subcategory
    SELECT DISTINCT ?subcategory (SAMPLE(?item) AS ?sampleItem)
    WHERE {
    ?item schema:brand ?brand . #choose same brand
    ?item schema:name ?name .
    ?item schema:isVariantOf ?subcategory .
    }
  GROUP BY ?subcategory
  }

  ?sampleItem schema:brand ?brand .
  ?sampleItem schema:name ?name .
  ?sampleItem schema:isVariantOf ?subcategory .
  }
ORDER BY RAND()

Results: (one of possible results)

Name:  Game Boy-posterset
subCategory:  home-and-gifts
Name:  Animal Crossing: New Horizons
subCategory:  games
Name:  Nintendo Switch (neonblauw/neonrood) Animal Crossing: New Horizons-bundel
subCategory:  nintendo-switch-bundles
Name:  Beenband
subCategory:  accessories
Name:  Kirby's Dream Buffet-sleutelhanger
subCategory:  apparel
Name:  Nintendo Switch met neonblauwe/neonrode Joy-Con-controllers
subCategory:  nintendo-switch-consoles
Name:  Another Code: Recollection
subCategory:  new
Name:  Kirby's Return to Dream Land Deluxe-muismat
subCategory:  franchises

------------

Query C: 

SELECT ?brand (AVG(?price) AS ?averagePrice)
WHERE {
  ?item schema:brand ?brand .
  ?item schema:price ?price .
}
GROUP BY ?brand

Results:

Brand:  Nintendo
Average Price:  101.22698113207538

------------
Question D1:
It's kinda meaningless to do this since we only have one brand here. We also wrote another sort by price version.

Query D: 

SELECT ?item ?category ?price
WHERE {
  {
    SELECT ?brand (AVG(?price) AS ?averagePrice)
    WHERE {
      ?item schema:brand ?brand .
      ?item schema:price ?price .
    }
  GROUP BY ?brand
  }

  {SELECT ?category #Here we choose a random category
    WHERE {
      ?item schema:isVariantOf ?category .
    }
    ORDER BY RAND()
    LIMIT 1
  }

  ?item schema:isVariantOf ?category.    
  ?item schema:price ?price .

}
ORDER BY ?averagePrice   #sort by average price

Results: (one of results, some of them can only be purchased by virtual currency, so their price is 0 here.)

item:  https://store.nintendo.nl/nl/nintendo-switch-oled-model-mario-edition-rood-000000000010011772
category nintendo-switch-consoles
price:  349.99
item:  https://store.nintendo.nl/nl/nintendo-switch-oled-model-wit-000000000010007454
category nintendo-switch-consoles
price:  349.99
item:  https://store.nintendo.nl/nl/consoles/nintendo-switch-consoles/nintendo-switch/nintendo-switch-met-neonblauweneonrode-joy-con-controllers-000000000010002207
category nintendo-switch-consoles
price:  299.99
item:  https://store.nintendo.nl/nl/nintendo-switch-oled-model-pokemon-scarlet-and-violet-edition-000000000010009862
category nintendo-switch-consoles
price:  359.99
item:  https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009866
category nintendo-switch-consoles
price:  359.99
item:  https://store.nintendo.nl/nl/nintendo-switch-oled-model-splatoon-3-edition-000000000010009642
category nintendo-switch-consoles
price:  359.99
item:  https://store.nintendo.nl/nl/nintendo-switch-oled-model-neonblauwneonrood-000000000010007455
category nintendo-switch-consoles
price:  349.99

------------
Question D2: sort by product value

Query D2:
SELECT ?item ?category ?price
WHERE {
  {
    #Here we choose a random category
    SELECT ?category
    WHERE {
      ?item schema:isVariantOf ?category .
    }
    ORDER BY RAND()
    LIMIT 1
  }

  ?item schema:isVariantOf ?category.    #Get all items within that category
  ?item schema:price ?price .

}
ORDER BY ?price   #sort by price

Results: (some products can only be purchased with virtual currency. We wrote them as 0 here.)

category:  franchises
item:  https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-muismat-000000000010011641
price:  0.0
category:  franchises
item:  https://store.nintendo.nl/nl/t-shirt-splatoon-3-splatfest-water-P00101
price:  19.99
category:  franchises
item:  https://store.nintendo.nl/nl/splatoon-3-70010000046396
price:  59.99
category:  franchises
item:  https://store.nintendo.nl/nl/super-mario-rpg-70010000068684
price:  59.99
category:  franchises
item:  https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021
price:  59.99
category:  franchises
item:  https://store.nintendo.nl/nl/super-mario-bros-wonder-70010000068689
price:  59.99
category:  franchises
item:  https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396
price:  429.99


------------
We only have one brand Nintendo:

Query E: (send to https://query.wikidata.org/sparql)

SELECT ?property ?propertyLabel (SAMPLE(?value) as ?sampleValue) (SAMPLE(?valueLabel) as ?sampleValueLabel)
WHERE {
  wd:Q8093 ?property ?value.
  SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
  FILTER (?property IN (wdt:P154, wdt:P159, wdt:P169,  wdt:P452,  wdt:P1448))
  
  #Q8093: Nintendo
  #154: logo image
  #159: headquarters location
  #169: chief executive officer
  #452: industry
  #1448: official name
}
GROUP BY ?property ?propertyLabel

Results:

P154:'http://commons.wikimedia.org/wiki/Special:FilePath/Nintendo.svg',
P159: 'http://www.wikidata.org/entity/Q34600',
P169: 'http://www.wikidata.org/entity/Q52177144',
P452: 'http://www.wikidata.org/entity/Q941594',
P1448: 'Nintendo Co., Ltd.'

------------

Query F: 

SELECT DISTINCT ?name1 ?name2 ?price1 ?price2 ?category
WHERE {
    ?item1 schema:price ?price1.
    ?item2 schema:price ?price2.

    # recommand item with similar price:
    ?item1 schema:name ?name1.
    ?item2 schema:name ?name2.

    ?item1 schema:isVariantOf ?category.
    ?item2 schema:isVariantOf ?category.

    FILTER (ABS(?price1 - ?price2) <= 1)
}
ORDER BY RAND()
Limit 1

Results: (one of possible results)

item:  Bayonetta 3
price:  59.99
category:  games
similar item:  Princess Peach: Showtime!
With price:  59.99
With category:  games

------
------------

G Question: what are the price of Switch? list their prices from low to high.

Why this query would be valuable in a webshop setting, such as for semantic search or other applications:
Since the core of Nintendo game series is to have a Switch, this query allows you to get all the items that include a Switch, whether it's a single machine or an bundle. When users want to buy a switch, a very important factor that determines which one they buy is the price. Providing all the prices of the switches and their bundles will make it easy for them to check.

Query G: 

SELECT ?name  ?price
  WHERE {
    ?switch schema:isVariantOf <https://store.nintendo.nl/nl/nintendo-switch-consoles>.
    ?switch schema:name ?name .
    ?switch schema:price ?price .
}
ORDER BY ?price   #sort by price


Results:

Name:  Nintendo Switch met neonblauwe/neonrode Joy-Con-controllers
Price:  299.99
Name:  Nintendo Switch – OLED-Model Mario Edition (rood)
Price:  349.99
Name:  Nintendo Switch - OLED-model (neonblauw/neonrood)
Price:  349.99
Name:  Nintendo Switch - OLED-model (wit)
Price:  349.99
Name:  Nintendo Switch – OLED Model Pokémon Scarlet & Violet Edition
Price:  359.99
Name:  Nintendo Switch™ – OLED-Model Splatoon 3 Edition
Price:  359.99
Name:  Nintendo Switch – OLED-model The Legend of Zelda: Tears of the Kingdom Edition 
Price:  359.99

-----------------------------------------------------------------------------------------------------------------------------

