{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Assignment 2\n",
    "Group 14\tNintendo shop - https://store.nintendo.nl/nl  \n",
    "Zijian Dong -i6226172\tAnqi Fan -i6272224\tQi Cui -i6288444\tTianyu Wei -i6231911\tZhefan Cheng -i6267501\n",
    "\n",
    "## Graph generating:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import URIRef, BNode, Literal, Namespace\n",
    "from rdflib.namespace import RDF, SDO, RDFS\n",
    "from rdflib import Graph\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Make a graph\n",
    "g = Graph()\n",
    "NS = Namespace('https://store.nintendo.nl/nl/')\n",
    "#--------------Categories------------------------------------\n",
    "\n",
    "console = NS['consoles']\n",
    "games = NS['games']\n",
    "merchandise = NS['merchandise'] #周边merchandise\n",
    "franchise = NS['franchises'] #独家ip 和其它的会重复Exclusive IP and others will be duplicated\n",
    "new_product = NS['new']\n",
    "\n",
    "#--------Sub-Categories--------------------------------------\n",
    "#--------Sub Categories for consoles-------------------------\n",
    "switch = NS['nintendo-switch-consoles'] #是console的product\n",
    "switch_bundle = NS['nintendo-switch-bundles'] #是console的product\n",
    "accessory = NS['accessories'] #是switch的配件\n",
    "#-------Sub Categories for merchandise-----------------\n",
    "apparel = NS['apparel']\n",
    "home_and_gifts = NS['home-and-gifts']\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nfd9b6956f8084b5790cb06a8ec9ac8e8 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#--------Instance--------------------------------------\n",
    "\n",
    "#Define types for Mainpage\n",
    "g.add((console, RDF.type, SDO.ProductGroup)) # triple set：\"_SubjectType\", \"_PredicateType\", \"_ObjectType\"\n",
    "g.add((games, RDF.type, SDO.ProductGroup))\n",
    "g.add((merchandise, RDF.type, SDO.ProductGroup))\n",
    "g.add((franchise, RDF.type, SDO.ProductGroup))\n",
    "g.add((new_product, RDF.type, SDO.ProductGroup))\n",
    "\n",
    "#Define subclasses of main categories\n",
    "g.add((switch, RDFS.subClassOf, console))\n",
    "g.add((switch_bundle, RDFS.subClassOf, console))\n",
    "g.add((accessory, RDFS.subClassOf, console))\n",
    "\n",
    "g.add((apparel, RDFS.subClassOf, merchandise))\n",
    "g.add((home_and_gifts, RDFS.subClassOf, merchandise))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "df = pd.read_csv(\"group-14_ken3140_webshop.csv\")\n",
    "\n",
    "for i,row in df.iterrows():\n",
    "    # Check if URI is empty, skip the empty ones\n",
    "    if not pd.isna(row[\"Item URI\"]) :\n",
    "        item = NS[row[\"Item URL\"].replace(\"https://store.nintendo.nl/nl/\",\"\").replace(\" \",\"\")]\n",
    "        for category in row['Category'].split(\",\"):\n",
    "            g.add((item, SDO.item, locals()[category]))\n",
    "        \n",
    "        g.add((item, RDF.type, SDO.Product))\n",
    "        g.add((item, SDO.name, Literal(row[\"Value 1\"])))\n",
    "        g.add((item, SDO.description, Literal(row[\"Value 2\"])))\n",
    "        g.add((item, SDO.sku, Literal(row[\"Value 3\"])))\n",
    "        g.add((item, SDO.price, Literal(row[\"Value 4\"])))\n",
    "        g.add((item, SDO.brand, Literal(\"Nintendo\"))) \n",
    "    #    graph.add((product, schema[row[\"link\"]],eval(row[\"type\"])))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[a rdfg:Graph;rdflib:storage [a rdflib:Store;rdfs:label 'Memory']].\n"
     ]
    }
   ],
   "source": [
    "g.bind('NS', NS)\n",
    "\n",
    "print(g.serialize('group-14_ken3140_webshop.ttl',format='turtle'))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## SPARQL:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Ne1f51b298e984bb4be71504424ed2206 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from rdflib import Graph\n",
    "\n",
    "graph = Graph()\n",
    "graph.parse(\"group-14_ken3140_webshop.ttl\", format=\"turtle\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "59.99\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "AN EXAMPLE\n",
    "'''\n",
    "item_info_query = \"\"\"\n",
    "SELECT ?price WHERE {\n",
    "  ?s schema:name 'Splatoon 3'.\n",
    "  ?s schema:price ?price.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "results = graph.query(item_info_query)\n",
    "for row in results:\n",
    "    print(row.price)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Questions:\n",
    "\n",
    "A. For a given item (select a random item from your RDF Graph), provide all its categories and subcategories, and its brand.\n",
    "\n",
    "B. Provide items from different subcategories that have the same brand.\n",
    "\n",
    "C. Group products by brand and show the average price or rating for each brand.\n",
    "\n",
    "D. Sort products in one category according to average brand price or rating.\n",
    "\n",
    "E. Use an external service point, provide a description of 5 facts about the top brand from part D (e.g. https://query.wikidata.org/), e.g. location of headquarters. You may return images as one of your facts.\n",
    "\n",
    "F. Recommend an item which is similar to the item using your linked RDF graph (i.e., shared properties and categories).\n",
    "\n",
    "G. Write your own question about the webshop in plain English, then translate it to the corresponding SPARQL query, and run it on the graph. Provide a rationale for why this query would be valuable in a webshop setting, such as for semantic search or other applications."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Name:  Nintendo Switch – OLED-model The Legend of Zelda: Tears of the Kingdom Edition \n",
      "Category:  consoles\n",
      "Subcategory:  https://store.nintendo.nl/nl/nintendo-switch-consoles\n",
      "Brand:  Nintendo\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "Query A\n",
    " For a given item (select a random item from your RDF Graph), provide all its categories and subcategories, and its brand.\n",
    "'''\n",
    "queryA = \"\"\"\n",
    "SELECT ?name ?subcategory ?category ?brand\n",
    "WHERE {\n",
    "  ?item schema:brand ?brand .                   #Get the brand\n",
    "  ?item schema:name ?name.                      #Get item name\n",
    "  ?item schema:item ?subcategory.            #Get the category.\n",
    "\n",
    "OPTIONAL {?subcategory rdfs:subClassOf ?category }    # if there exist subcategory, also get it.\n",
    "  }\n",
    "\n",
    "ORDER BY RAND()\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "resultA = graph.query(queryA)\n",
    "for row in resultA:\n",
    "    print('Name: ',row.name)\n",
    "    if(row.category==None):\n",
    "      print('Category: ',row.subcategory.replace(\"https://store.nintendo.nl/nl/\",\"\").replace(\"\",\"\"))\n",
    "    if(row.category!=None):\n",
    "      print('Category: ',row.category.replace(\"https://store.nintendo.nl/nl/\",\"\").replace(\"\",\"\"))\n",
    "      print('Subcategory: ',row.subcategory.replace(row.category+\"/\",\"\").replace(\"\",\"\"))\n",
    "    print('Brand: ',row.brand)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Name:  Game Boy-posterset\n",
      "subCategory:  home-and-gifts\n",
      "Name:  Beenband\n",
      "subCategory:  accessories\n",
      "Name:  Nintendo Switch (neonblauw/neonrood) Animal Crossing: New Horizons-bundel\n",
      "subCategory:  nintendo-switch-bundles\n",
      "Name:  Animal Crossing: New Horizons\n",
      "subCategory:  games\n",
      "Name:  Kirby's Return to Dream Land Deluxe-muismat\n",
      "subCategory:  franchises\n",
      "Name:  Nintendo Switch met neonblauwe/neonrode Joy-Con-controllers\n",
      "subCategory:  nintendo-switch-consoles\n",
      "Name:  Kirby's Dream Buffet-sleutelhanger\n",
      "subCategory:  apparel\n",
      "Name:  Another Code: Recollection\n",
      "subCategory:  new\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "Query B\n",
    " Provide items from different subcategories that have the same brand\n",
    "'''\n",
    "queryB = \"\"\"\n",
    "SELECT ?name ?subcategory\n",
    "WHERE {\n",
    "\n",
    "  {\n",
    "    #SAMPLE: We choose 1 item from each subcategory\n",
    "    SELECT DISTINCT ?subcategory (SAMPLE(?item) AS ?sampleItem)\n",
    "    WHERE {\n",
    "    ?item schema:brand ?brand . #choose same brand\n",
    "    ?item schema:name ?name .\n",
    "    ?item schema:item ?subcategory .\n",
    "    }\n",
    "  GROUP BY ?subcategory\n",
    "  }\n",
    "\n",
    "  ?sampleItem schema:brand ?brand .\n",
    "  ?sampleItem schema:name ?name .\n",
    "  ?sampleItem schema:item ?subcategory .\n",
    "  }\n",
    "ORDER BY RAND()\n",
    "\"\"\"\n",
    "\n",
    "resultB = graph.query(queryB)\n",
    "for row in resultB:\n",
    "    print('Name: ',row.name)\n",
    "    print('subCategory: ',row.subcategory.replace(\"https://store.nintendo.nl/nl/\",\"\").replace(\"\",\"\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Brand:  Nintendo\n",
      "Average Price:  101.22698113207538\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "Query C\n",
    " Group products by brand and show the average price or rating for each brand.\n",
    "'''\n",
    "queryC = \"\"\"\n",
    "SELECT ?brand (AVG(?price) AS ?averagePrice)\n",
    "WHERE {\n",
    "  ?item schema:brand ?brand .\n",
    "  ?item schema:price ?price .\n",
    "}\n",
    "GROUP BY ?brand\n",
    "\"\"\"\n",
    "\n",
    "resultC = graph.query(queryC)\n",
    "for row in resultC:\n",
    "    print('Brand: ',row.brand)\n",
    "    print('Average Price: ',row.averagePrice)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "category:  new\n",
      "item:  https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315\n",
      "price:  0.0\n",
      "category:  new\n",
      "item:  https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html\n",
      "price:  39.99\n",
      "category:  new\n",
      "item:  https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106\n",
      "price:  49.99\n",
      "category:  new\n",
      "item:  https://store.nintendo.nl/nl/fae-farm-P00115\n",
      "price:  59.99\n",
      "category:  new\n",
      "item:  https://store.nintendo.nl/nl/super-mario-rpg-70010000068684\n",
      "price:  59.99\n",
      "category:  new\n",
      "item:  https://store.nintendo.nl/nl/pikmin-4-70010000005306\n",
      "price:  59.99\n",
      "category:  new\n",
      "item:  https://store.nintendo.nl/nl/another-code-recollection-70010000072197\n",
      "price:  59.99\n",
      "category:  new\n",
      "item:  https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021\n",
      "price:  59.99\n",
      "category:  new\n",
      "item:  https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396\n",
      "price:  429.99\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "Query D\n",
    " Sort products in one category according to average brand price or rating.\n",
    " Note: we only have one brand here, so we sort it according to its price\n",
    "'''\n",
    "queryD = \"\"\"\n",
    "SELECT ?item ?category ?price\n",
    "WHERE {\n",
    "  {\n",
    "    #Here we choose a random category\n",
    "    SELECT ?category\n",
    "    WHERE {\n",
    "      ?item schema:item ?category .\n",
    "    }\n",
    "    ORDER BY RAND()\n",
    "    LIMIT 1\n",
    "  }\n",
    "\n",
    "  ?item schema:item ?category.    #Get all items within that category\n",
    "  ?item schema:price ?price .\n",
    "\n",
    "}\n",
    "ORDER BY ?price   #sort by price\n",
    "\"\"\"\n",
    "\n",
    "resultD = graph.query(queryD)\n",
    "for row in resultD:\n",
    "    print('category: ',row.category.replace(\"https://store.nintendo.nl/nl/\",\"\").replace(\"\",\"\"))\n",
    "    print('item: ',row.item)\n",
    "    print('price: ',row.price)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "item:  https://store.nintendo.nl/nl/fae-farm-P00115\n",
      "category new\n",
      "price:  59.99\n",
      "item:  https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396\n",
      "category new\n",
      "price:  429.99\n",
      "item:  https://store.nintendo.nl/nl/super-mario-rpg-70010000068684\n",
      "category new\n",
      "price:  59.99\n",
      "item:  https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html\n",
      "category new\n",
      "price:  39.99\n",
      "item:  https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106\n",
      "category new\n",
      "price:  49.99\n",
      "item:  https://store.nintendo.nl/nl/pikmin-4-70010000005306\n",
      "category new\n",
      "price:  59.99\n",
      "item:  https://store.nintendo.nl/nl/another-code-recollection-70010000072197\n",
      "category new\n",
      "price:  59.99\n",
      "item:  https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021\n",
      "category new\n",
      "price:  59.99\n",
      "item:  https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315\n",
      "category new\n",
      "price:  0.0\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "Query D\n",
    " Sort products in one category according to average brand price or rating.\n",
    "'''\n",
    "queryD = \"\"\"\n",
    "SELECT ?item ?category ?price\n",
    "WHERE {\n",
    "  {\n",
    "    SELECT ?brand (AVG(?price) AS ?averagePrice)\n",
    "    WHERE {\n",
    "      ?item schema:brand ?brand .\n",
    "      ?item schema:price ?price .\n",
    "    }\n",
    "  GROUP BY ?brand\n",
    "  }\n",
    "\n",
    "  {SELECT ?category #Here we choose a random category\n",
    "    WHERE {\n",
    "      ?item schema:item ?category .\n",
    "    }\n",
    "    ORDER BY RAND()\n",
    "    LIMIT 1\n",
    "  }\n",
    "\n",
    "  ?item schema:item ?category.    \n",
    "  ?item schema:price ?price .\n",
    "\n",
    "}\n",
    "ORDER BY ?averagePrice   #sort by average price\n",
    "\"\"\"\n",
    "\n",
    "resultD = graph.query(queryD)\n",
    "for row in resultD:\n",
    "    print('item: ',row.item)\n",
    "    print('category', row.category.replace(\"https://store.nintendo.nl/nl/\",\"\").replace(\"\",\"\"))\n",
    "    print('price: ',row.price)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['http://commons.wikimedia.org/wiki/Special:FilePath/Nintendo.svg',\n",
       " 'http://www.wikidata.org/entity/Q34600',\n",
       " 'http://www.wikidata.org/entity/Q52177144',\n",
       " 'http://www.wikidata.org/entity/Q941594',\n",
       " 'Nintendo Co., Ltd.']"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "'''\n",
    "Query E\n",
    "E. Use an external service point, provide a description of 5 facts about the top brand from part D (e.g. https://query.wikidata.org/), e.g. location of headquarters. You may return images as one of your facts.\n",
    "'''\n",
    "import requests\n",
    "\n",
    "url = 'https://query.wikidata.org/sparql'\n",
    "queryE = '''\n",
    "SELECT ?property ?propertyLabel (SAMPLE(?value) as ?sampleValue) (SAMPLE(?valueLabel) as ?sampleValueLabel)\n",
    "WHERE {\n",
    "  wd:Q8093 ?property ?value.\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "  FILTER (?property IN (wdt:P154, wdt:P159, wdt:P169,  wdt:P452,  wdt:P1448))\n",
    "  \n",
    "  #Q8093: Nintendo\n",
    "  #154: logo image\n",
    "  #159: headquarters location\n",
    "  #452: industry\n",
    "  #1448: official name\n",
    "  #169: chief executive officer\n",
    "}\n",
    "GROUP BY ?property ?propertyLabel\n",
    "'''\n",
    "r = requests.get(url, params = {'format': 'json', 'query': queryE})\n",
    "data = r.json()\n",
    "resultE = []\n",
    "for each in data['results']['bindings']:\n",
    "    resultE.append(each['sampleValue']['value'])\n",
    "resultE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "item:  Shin Megami Tensei V\n",
      "price:  59.99\n",
      "category:  games\n",
      "similar item:  Super Mario Party™\n",
      "With price:  59.99\n",
      "With category:  games\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "Query F\n",
    "F. Recommend an item which is similar to the item using your linked RDF graph (i.e., shared properties and categories).\n",
    "'''\n",
    "queryF = \"\"\"\n",
    "SELECT DISTINCT ?name1 ?name2 ?price1 ?price2 ?category\n",
    "WHERE {\n",
    "    ?item1 schema:price ?price1.\n",
    "    ?item2 schema:price ?price2.\n",
    "\n",
    "    # recommand item with similar price:\n",
    "    ?item1 schema:name ?name1.\n",
    "    ?item2 schema:name ?name2.\n",
    "\n",
    "    ?item1 schema:item ?category.\n",
    "    ?item2 schema:item ?category.\n",
    "\n",
    "    FILTER (ABS(?price1 - ?price2) <= 1)\n",
    "}\n",
    "ORDER BY RAND()\n",
    "Limit 1\n",
    "\"\"\"\n",
    "\n",
    "resultF = graph.query(queryF)\n",
    "for row in resultF:\n",
    "    print('item: ',row.name1)\n",
    "    print('price: ',row.price1)\n",
    "    print('category: ',row.category.replace(\"https://store.nintendo.nl/nl/\",\"\").replace(\"\",\"\"))\n",
    "\n",
    "    print('similar item: ',row.name2)  \n",
    "    print('With price: ',row.price2)\n",
    "    print('With category: ',row.category.replace(\"https://store.nintendo.nl/nl/\",\"\").replace(\"\",\"\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Name:  Nintendo Switch met neonblauwe/neonrode Joy-Con-controllers\n",
      "Price:  299.99\n",
      "Name:  Nintendo Switch – OLED-Model Mario Edition (rood)\n",
      "Price:  349.99\n",
      "Name:  Nintendo Switch - OLED-model (neonblauw/neonrood)\n",
      "Price:  349.99\n",
      "Name:  Nintendo Switch - OLED-model (wit)\n",
      "Price:  349.99\n",
      "Name:  Nintendo Switch – OLED Model Pokémon Scarlet & Violet Edition\n",
      "Price:  359.99\n",
      "Name:  Nintendo Switch™ – OLED-Model Splatoon 3 Edition\n",
      "Price:  359.99\n",
      "Name:  Nintendo Switch – OLED-model The Legend of Zelda: Tears of the Kingdom Edition \n",
      "Price:  359.99\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "Query G\n",
    "Write your own question about the webshop in plain English, then translate it to the corresponding SPARQL query, and run it on the graph. Provide a rationale for why this query would be valuable in a webshop setting, such as for semantic search or other applications.\n",
    "\n",
    "Question: what are the price of Switch? list their prices from low to high.\n",
    "'''\n",
    "\n",
    "queryG = \"\"\"\n",
    "SELECT ?name  ?price\n",
    "  WHERE {\n",
    "    ?switch schema:item <https://store.nintendo.nl/nl/nintendo-switch-consoles>.\n",
    "    ?switch schema:name ?name .\n",
    "    ?switch schema:price ?price .\n",
    "}\n",
    "ORDER BY ?price   #sort by price\n",
    "\"\"\"\n",
    "\n",
    "resultG = graph.query(queryG)\n",
    "for row in resultG:\n",
    "       print('Name: ',row.name)\n",
    "       print('Price: ',row.price)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-legends-arceus-P00045'), rdflib.term.Literal('Vang, volg en onderzoek wilde Pokémon om de eerste Pokédex van de regio Sinnoh in Pokémon Legends: Arceus te maken en te voltooien._x000D_\\r\\n'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/animal-crossing-new-horizons-70010000027620'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/metroid-dread-70010000042925'), rdflib.term.Literal('70010000042925'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-rpg-70010000068684'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-pokemon-scarlet-and-violet-edition-000000000010009862'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-10-kazuya-P00073'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/animal-crossing-new-horizons-70010000027620'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106'), rdflib.term.URIRef('https://store.nintendo.nl/nl/new'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-propeller-mario-nintendo-tokyo-exclusive-collection-000000000010004852'), rdflib.term.Literal('Vier het 35-jarig jubileum van Super Mario Bros. met deze Knuffel Propeller-Mario, exclusief verkrijgbaar in de My Nintendo Store.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-sports-P00086'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/xenoblade-chronicles-3-70010000053337'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-bros-wonder-70010000068689'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/ring-fit-adventure-000000000010001992'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-wit-000000000010007454'), rdflib.term.Literal('Nintendo Switch - OLED-model (wit)'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-sports-P00086'), rdflib.term.Literal('39.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-pro-controller-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009831'), rdflib.term.URIRef('https://store.nintendo.nl/nl/accessories'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/ring-fit-adventure-000000000010001992'), rdflib.term.Literal('79.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-draagtas-000000000010012062'), rdflib.term.Literal('Spring je volgende avontuur tegemoet met deze Super Mario-tas om je arm!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-muismat-000000000010011641'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/gamestudio-P00075'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bravely-default-ii-70010000028618'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/ring-fit-adventure-000000000010001992'), rdflib.term.Literal('Ring Fit Adventure'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-animal-crossing-new-horizons-bundel-B00403'), rdflib.term.Literal('Deze systeembundel bevat de Nintendo Switch met neonblauw/neonrood Joy-Con-controllers, de game Animal Crossing: New Horizons, en een Nintendo Switch-hardcase - Deluxe Elite Edition.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-draagtas-000000000010012062'), rdflib.term.Literal('000000000010012062'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/triangle-strategy-70010000046321'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/another-code-recollection-70010000072197'), rdflib.term.Literal('70010000072197'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-van-min-min-70050000018967'), rdflib.term.Literal('5.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-animal-crossing-new-horizons-bundel-B00403'), rdflib.term.Literal('B00403'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-sword-en-pokemon-shield-expansion-pass-P00008'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bravely-default-ii-70010000028618'), rdflib.term.Literal('70010000028618'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirby-speelkaarten-000000000010001931'), rdflib.term.Literal('000000000010001931'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-legends-arceus-P00045'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315'), rdflib.term.Literal('Laat de Pikmin meehelpen bij het afdrogen met deze Pikmin 4-theedoek!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-draagtas-000000000010012062'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/another-code-recollection-70010000072197'), rdflib.term.URIRef('https://store.nintendo.nl/nl/new'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/xenoblade-chronicles-3-70010000053337'), rdflib.term.Literal('Xenoblade Chronicles 3'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-draagtas-000000000010012062'), rdflib.term.URIRef('https://store.nintendo.nl/nl/apparel'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirby-speelkaarten-000000000010001931'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-bros-wonder-70010000068689'), rdflib.term.URIRef('https://store.nintendo.nl/nl/franchises'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-mario-edition-rood-000000000010011772'), rdflib.term.Literal('Met de Nintendo Switch – OLED-model kun je altijd en overal genieten van je favoriete games, met een levendig 7-inch OLED-scherm met levendige kleuren.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021'), rdflib.term.URIRef('https://store.nintendo.nl/nl/new'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-bros-wonder-70010000068689'), rdflib.term.Literal('Verwacht het onverwachte!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-sword-en-pokemon-shield-expansion-pass-P00008'), rdflib.term.Literal('Het wilde avontuur gaat verder met de uitbreidingspas van Pokémon Sword en Pokémon Shield!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-mario-tanuki-nintendo-tokyo-exclusive-collection-000000000010004851'), rdflib.term.URIRef('https://store.nintendo.nl/nl/home-and-gifts'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-luigis-mansion-3-bundel-B00418'), rdflib.term.Literal('359.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/another-code-recollection-70010000072197'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-scarlet-70010000053967'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-64-paperclips-000000000010009889'), rdflib.term.Literal('Deze paperclips in de vorm van Nintendo 64-controllers zijn nu exclusief verkrijgbaar op My Nintendo!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/splatoon-3-70010000046396'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-mario-tanuki-nintendo-tokyo-exclusive-collection-000000000010004851'), rdflib.term.Literal('24.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-mario-tanuki-nintendo-tokyo-exclusive-collection-000000000010004851'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-animal-crossing-new-horizons-bundel-B00403'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/t-shirt-splatoon-3-splatfest-water-P00101'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/xenoblade-chronicles-3-70010000053337'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009866'), rdflib.term.Literal('000000000010009866'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/mario-kart-8-deluxe-70010000000126'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/monster-hunter-rise-70010000029015'), rdflib.term.Literal('70010000029015'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/ring-fit-adventure-000000000010001992'), rdflib.term.Literal('000000000010001992'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-consoles'), rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#subClassOf'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-pokemon-scarlet-and-violet-edition-000000000010009862'), rdflib.term.Literal('Met de Nintendo Switch – OLED-model kun je altijd en overal genieten van je favoriete games, met een levendig 7-inch OLED-scherm met levendige kleuren.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/xenoblade-chronicles-3-70010000053337'), rdflib.term.Literal('70010000053337'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-muismat-000000000010011641'), rdflib.term.Literal('0.0', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/metroid-dread-70010000042925'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-pokemon-scarlet-and-violet-edition-000000000010009862'), rdflib.term.Literal('Nintendo Switch – OLED Model Pokémon Scarlet & Violet Edition'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-mario-edition-rood-000000000010011772'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-draagtas-000000000010012062'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-rpg-70010000068684'), rdflib.term.URIRef('https://store.nintendo.nl/nl/new'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396'), rdflib.term.Literal('B00396'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-bros-wonder-70010000068689'), rdflib.term.Literal('70010000068689'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/tokyo-mirage-sessions-fe-encore-70010000023326'), rdflib.term.Literal('Tokyo Mirage Sessions ♯FE Encore'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/mario-kart-8-deluxe-70010000000126'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html'), rdflib.term.Literal('De koelbloedige en bedreven Samus gaat deze missie in haar eentje aan… maar ze is alles behalve alleen.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-64-paperclips-000000000010009889'), rdflib.term.URIRef('https://store.nintendo.nl/nl/home-and-gifts'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles/nintendo-switch-consoles/nintendo-switch/nintendo-switch-met-neonblauweneonrode-joy-con-controllers-000000000010002207'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-rpg-70010000068684'), rdflib.term.URIRef('https://store.nintendo.nl/nl/franchises'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-van-min-min-70050000018967'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021'), rdflib.term.Literal('Prinses Peach staat in de schijnwerpers!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-10-kazuya-P00073'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-party-70010000014063'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-64-paperclips-000000000010009889'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-scarlet-70010000053967'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315'), rdflib.term.URIRef('https://store.nintendo.nl/nl/home-and-gifts'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-animal-crossing-new-horizons-bundel-B00403'), rdflib.term.Literal('359.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-scarlet-70010000053967'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-10-kazuya-P00073'), rdflib.term.Literal('P00073'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-bros-wonder-70010000068689'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/accessories'), rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#subClassOf'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/t-shirt-splatoon-3-splatfest-water-P00101'), rdflib.term.Literal(\"T-shirt Splatoon 3 Splatfest 'Water'\"), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-propeller-mario-nintendo-tokyo-exclusive-collection-000000000010004852'), rdflib.term.Literal('000000000010004852'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bayonetta-3-70010000046401'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-10-kazuya-P00073'), rdflib.term.Literal('Kazuya maakt zich klaar voor het volgende gevecht in Challenger Pack 10.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/fae-farm-P00115'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-70010000005306'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/apparel'), rdflib.term.URIRef('https://store.nintendo.nl/nl/merchandise'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#subClassOf'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/beenband-000000000010001376'), rdflib.term.Literal('10.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396'), rdflib.term.URIRef('https://store.nintendo.nl/nl/new'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-wit-000000000010007454'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/triangle-strategy-70010000046321'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-sword-en-pokemon-shield-expansion-pass-P00008'), rdflib.term.Literal('29.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-luigis-mansion-3-bundel-B00418'), rdflib.term.Literal(\"Nintendo Switch (neonblauw/neonrood) Luigi's Mansion 3-bundel\"), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-mario-edition-rood-000000000010011772'), rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-consoles'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/splatoon-3-70010000046396'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html'), rdflib.term.Literal('P00105'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bravely-default-ii-70010000028618'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-splatoon-3-edition-000000000010009642'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/tokyo-mirage-sessions-fe-encore-70010000023326'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009866'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/uitbreidingspas-fire-emblem-engage-P00102'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-luigis-mansion-3-bundel-B00418'), rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-bundles'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/gamestudio-P00075'), rdflib.term.Literal('P00075'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-dream-buffet-sleutelhanger-000000000010010992'), rdflib.term.Literal('0.0', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-neonblauwneonrood-000000000010007455'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/uitbreidingspas-fire-emblem-engage-P00102'), rdflib.term.Literal('P00102'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-legends-arceus-P00045'), rdflib.term.Literal('P00045'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-van-min-min-70050000018967'), rdflib.term.Literal('Wie is er op zoek naar actie? De ramenminnende Min Min uit ARMS mengt zich in het gevecht in Challenger Pack 6!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/triangle-strategy-70010000046321'), rdflib.term.Literal('70010000046321'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bayonetta-3-70010000046401'), rdflib.term.Literal('De heks is terug… en sterker dan ooit!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/beenband-000000000010001376'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-propeller-mario-nintendo-tokyo-exclusive-collection-000000000010004852'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-10-kazuya-P00073'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-scarlet-70010000053967'), rdflib.term.Literal('Pokémon Scarlet en Pokémon Violet, de nieuwste avonturen in de Pokémon-serie, komen op 18 november naar de Nintendo Switch.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-dream-buffet-sleutelhanger-000000000010010992'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106'), rdflib.term.Literal('49.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-muismat-000000000010011641'), rdflib.term.Literal(\"Kirby's Return to Dream Land Deluxe-muismat\"), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-sports-P00086'), rdflib.term.Literal('P00086'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/splatoon-3-70010000046396'), rdflib.term.URIRef('https://store.nintendo.nl/nl/franchises'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-mario-tanuki-nintendo-tokyo-exclusive-collection-000000000010004851'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/gamestudio-P00075'), rdflib.term.Literal('29.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-splatoon-3-edition-000000000010009642'), rdflib.term.Literal('Met de Nintendo Switch – OLED-model kun je altijd en overal genieten van je favoriete games, met een levendig 7-inch OLED-scherm met levendige kleuren.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-violet-70010000053972'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/t-shirt-splatoon-3-splatfest-water-P00101'), rdflib.term.URIRef('https://store.nintendo.nl/nl/apparel'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/ring-fit-adventure-000000000010001992'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-scarlet-70010000053967'), rdflib.term.Literal('70010000053967'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/animal-crossing-new-horizons-70010000027620'), rdflib.term.Literal('Als de drukte van het moderne leven je te pakken krijgt, heeft Tom Nook een zakelijke onderneming in zijn mouw waarvan hij weet dat je het geweldig zult vinden: zijn gloednieuwe, ultra-exclusieve Nook Inc. Eilandleven-pakket!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-luigis-mansion-3-bundel-B00418'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-rpg-70010000068684'), rdflib.term.Literal('Super Mario RPG'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/triangle-strategy-70010000046321'), rdflib.term.Literal('Triangle Strategy™'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009866'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles/nintendo-switch-consoles/nintendo-switch/nintendo-switch-met-neonblauweneonrode-joy-con-controllers-000000000010002207'), rdflib.term.Literal('000000000010002207'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-10-kazuya-P00073'), rdflib.term.Literal('Challenger Pack 10: Kazuya'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021'), rdflib.term.Literal('Princess Peach: Showtime!'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-draagtas-000000000010012062'), rdflib.term.Literal('0.0', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles'), rdflib.term.URIRef('https://schema.org/ProductGroup'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bravely-default-ii-70010000028618'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/splatoon-3-70010000046396'), rdflib.term.Literal('70010000046396'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-legends-arceus-P00045'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-70010000005306'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/mario-kart-8-deluxe-70010000000126'), rdflib.term.Literal('Mario Kart™ 8 Deluxe'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/gamestudio-P00075'), rdflib.term.Literal('Ontdek hoe je games kunt maken bij Nintendo!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-sword-en-pokemon-shield-expansion-pass-P00008'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-wit-000000000010007454'), rdflib.term.Literal('Met de Nintendo Switch – OLED-model kun je altijd en overal genieten van je favoriete games, met een levendig 7-inch OLED-scherm met levendige kleuren.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/monster-hunter-rise-70010000029015'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/shin-megami-tensei-v-P00070'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-van-min-min-70050000018967'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/gamestudio-P00075'), rdflib.term.Literal('Gamestudio'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-animal-crossing-new-horizons-bundel-B00403'), rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-bundles'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/another-code-recollection-70010000072197'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/game-boy-posterset-000000000010011600'), rdflib.term.URIRef('https://store.nintendo.nl/nl/home-and-gifts'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009866'), rdflib.term.Literal('Met de Nintendo Switch – OLED-model kun je altijd en overal genieten van je favoriete games, met een levendig 7-inch OLED-scherm met levendige kleuren.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/shin-megami-tensei-v-P00070'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-party-70010000014063'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/tokyo-mirage-sessions-fe-encore-70010000023326'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-pro-controller-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009831'), rdflib.term.Literal('Nintendo Switch-Pro-controller (The Legend of Zelda: Tears of the Kingdom Edition)'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-70010000005306'), rdflib.term.URIRef('https://store.nintendo.nl/nl/new'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-pokemon-scarlet-and-violet-edition-000000000010009862'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-sports-P00086'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-van-min-min-70050000018967'), rdflib.term.Literal('Challenger Pack van Min Min'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-pro-controller-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009831'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-luigis-mansion-3-bundel-B00418'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-mario-edition-rood-000000000010011772'), rdflib.term.Literal('349.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-party-70010000014063'), rdflib.term.Literal('Super Mario Party™'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/uitbreidingspas-fire-emblem-engage-P00102'), rdflib.term.Literal('Met de Fire Emblem Engage-uitbreidingspas kun je nieuwe Emblem-helden gebruiken en nieuwe gevechten aangaan.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/uitbreidingspas-fire-emblem-engage-P00102'), rdflib.term.Literal('29.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bayonetta-3-70010000046401'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/fae-farm-P00115'), rdflib.term.Literal('Fae Farm'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/fae-farm-P00115'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-muismat-000000000010011641'), rdflib.term.URIRef('https://store.nintendo.nl/nl/apparel'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/new'), rdflib.term.URIRef('https://schema.org/ProductGroup'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-muismat-000000000010011641'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/beenband-000000000010001376'), rdflib.term.URIRef('https://store.nintendo.nl/nl/accessories'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/metroid-dread-70010000042925'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-sports-P00086'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-70010000005306'), rdflib.term.Literal('Pikmin 4'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bravely-default-ii-70010000028618'), rdflib.term.Literal('Vier helden, vier kristallen, één legendarisch avontuur!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-wit-000000000010007454'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirby-speelkaarten-000000000010001931'), rdflib.term.Literal('Speelkaarten van Kirby en zijn vrienden!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106'), rdflib.term.Literal('Minecraft Legends Deluxe Edition'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-pro-controller-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009831'), rdflib.term.Literal('000000000010009831'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/t-shirt-splatoon-3-splatfest-water-P00101'), rdflib.term.Literal('19.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bravely-default-ii-70010000028618'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-muismat-000000000010011641'), rdflib.term.Literal('Waan je op de planeet Popstar met deze Kirby’s Return to Dream Land Deluxe-muismat, waarop de roze held in eigen persoon prijkt!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/t-shirt-splatoon-3-splatfest-water-P00101'), rdflib.term.Literal(\"Laat de wereld met dit T-shirt Splatoon 3 Splatfest 'Water' zien welke kant jij kiest in het Splatfest Splatoon x Pokémon.\"), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/uitbreidingspas-fire-emblem-engage-P00102'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/gamestudio-P00075'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009866'), rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-consoles'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/t-shirt-splatoon-3-splatfest-water-P00101'), rdflib.term.Literal('P00101'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/triangle-strategy-70010000046321'), rdflib.term.Literal('Waar brengt jouw gevoel van gerechtigheid je naartoe in TRIANGLE STRATEGY, een tactische RPG van Square Enix voor de Nintendo Switch? Bestel en ontvang een GRATIS verzamelkaartenset (zolang de voorraad strekt).'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/franchises'), rdflib.term.URIRef('https://schema.org/ProductGroup'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/fae-farm-P00115'), rdflib.term.Literal('P00115'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/shin-megami-tensei-v-P00070'), rdflib.term.Literal('Shin Megami Tensei V'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-sword-en-pokemon-shield-expansion-pass-P00008'), rdflib.term.Literal('Pokémon Sword en Pokémon Shield - Expansion Pass'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/splatoon-3-70010000046396'), rdflib.term.Literal('Splatoon 3'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-dream-buffet-sleutelhanger-000000000010010992'), rdflib.term.Literal(\"Met deze schattige Kirby-sleutelhanger, die is geïnspireerd op Kirby's Dream Buffet, zie je er smaakvol uit!\"), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-mario-edition-rood-000000000010011772'), rdflib.term.Literal('Nintendo Switch – OLED-Model Mario Edition (rood)'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/beenband-000000000010001376'), rdflib.term.Literal('Het beenbandaccessoire meet je acties in de echte wereld en zet ze om in bewegingen in de game.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-muismat-000000000010011641'), rdflib.term.Literal('000000000010011641'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-wit-000000000010007454'), rdflib.term.Literal('349.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-64-paperclips-000000000010009889'), rdflib.term.Literal('0.0', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-splatoon-3-edition-000000000010009642'), rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-consoles'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html'), rdflib.term.Literal('Metroid Prime Remastered'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-70010000058798'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/another-code-recollection-70010000072197'), rdflib.term.Literal('Another Code: Recollection'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirby-speelkaarten-000000000010001931'), rdflib.term.Literal('Kirby Speelkaarten'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-neonblauwneonrood-000000000010007455'), rdflib.term.Literal('000000000010007455'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/metroid-dread-70010000042925'), rdflib.term.Literal('Sluit je aan bij premiejager Samus Aran terwijl ze ontsnapt aan een dodelijke buitenaardse wereld die wordt geplaagd door een mechanische dreiging in Metroid Dread voor de Nintendo Switch. Bestel en ontvang een GRATIS sleutelhanger, stickervel en dubbelzijdige A2-poster (zolang de voorraad strekt).'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-rpg-70010000068684'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/game-boy-posterset-000000000010011600'), rdflib.term.Literal('Game Boy-posterset'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-pokemon-scarlet-and-violet-edition-000000000010009862'), rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-consoles'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/animal-crossing-new-horizons-70010000027620'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/game-boy-posterset-000000000010011600'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/game-boy-posterset-000000000010011600'), rdflib.term.Literal('000000000010011600'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-wit-000000000010007454'), rdflib.term.Literal('000000000010007454'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/ring-fit-adventure-000000000010001992'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-70010000058798'), rdflib.term.Literal('70010000058798'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-mario-edition-rood-000000000010011772'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-70010000005306'), rdflib.term.Literal('70010000005306'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/monster-hunter-rise-70010000029015'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-animal-crossing-new-horizons-bundel-B00403'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-rpg-70010000068684'), rdflib.term.Literal('Wensen kunnen uitkomen in Super Mario RPG!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/t-shirt-splatoon-3-splatfest-water-P00101'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bayonetta-3-70010000046401'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-van-min-min-70050000018967'), rdflib.term.Literal('70050000018967'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-animal-crossing-new-horizons-bundel-B00403'), rdflib.term.Literal('Nintendo Switch (neonblauw/neonrood) Animal Crossing: New Horizons-bundel'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-bundles'), rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#subClassOf'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-wit-000000000010007454'), rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-consoles'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-sports-P00086'), rdflib.term.Literal('Zwaai, trap en smash je een weg naar de overwinning met Nintendo Switch Sports, een verzameling sporten voor de Nintendo Switch die je flink in beweging houdt!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bayonetta-3-70010000046401'), rdflib.term.Literal('70010000046401'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/beenband-000000000010001376'), rdflib.term.Literal('Beenband'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009866'), rdflib.term.Literal('Nintendo Switch – OLED-model The Legend of Zelda: Tears of the Kingdom Edition '), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/mario-kart-8-deluxe-70010000000126'), rdflib.term.Literal('Geniet van de grootste Mario Kart tot nu toe en race altijd en overal, met iedereen in Mario Kart 8 Deluxe, alleen op de Nintendo Switch!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-sword-en-pokemon-shield-expansion-pass-P00008'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-pokemon-scarlet-and-violet-edition-000000000010009862'), rdflib.term.Literal('359.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/shin-megami-tensei-v-P00070'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-mario-tanuki-nintendo-tokyo-exclusive-collection-000000000010004851'), rdflib.term.Literal('Vier het 35-jarig jubileum van Super Mario Bros. met deze Knuffel Mario Tanuki, exclusief verkrijgbaar in My Nintendo Store.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/splatoon-3-70010000046396'), rdflib.term.Literal('Pinta as Splatlands no próximo Splatoon! Splatoon 3 chega à Nintendo Switch a 9 de setembro!\\t\\t\\t\\t\\t\\t\\t_x000D_\\r\\n'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/triangle-strategy-70010000046321'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/mario-kart-8-deluxe-70010000000126'), rdflib.term.Literal('70010000000126'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-dream-buffet-sleutelhanger-000000000010010992'), rdflib.term.Literal('000000000010010992'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-sword-en-pokemon-shield-expansion-pass-P00008'), rdflib.term.Literal('P00008'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-mario-tanuki-nintendo-tokyo-exclusive-collection-000000000010004851'), rdflib.term.Literal('Knuffel Mario Tanuki - Nintendo Tokyo Exclusive Collection'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-mario-tanuki-nintendo-tokyo-exclusive-collection-000000000010004851'), rdflib.term.Literal('000000000010004851'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315'), rdflib.term.URIRef('https://store.nintendo.nl/nl/new'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/xenoblade-chronicles-3-70010000053337'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-64-paperclips-000000000010009889'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-splatoon-3-edition-000000000010009642'), rdflib.term.Literal('000000000010009642'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/monster-hunter-rise-70010000029015'), rdflib.term.Literal('Monster Hunter Rise'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-legends-arceus-P00045'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/game-boy-posterset-000000000010011600'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles/nintendo-switch-consoles/nintendo-switch/nintendo-switch-met-neonblauweneonrode-joy-con-controllers-000000000010002207'), rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-consoles'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bayonetta-3-70010000046401'), rdflib.term.Literal('Bayonetta 3'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bayonetta-3-70010000046401'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/animal-crossing-new-horizons-70010000027620'), rdflib.term.Literal('70010000027620'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/fae-farm-P00115'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/splatoon-3-70010000046396'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396'), rdflib.term.Literal('Nintendo Switch – OLED-model The Legend of Zelda: Tears of the Kingdom Edition + The Legend of Zelda: Tears of the Kingdom-bundel'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/tokyo-mirage-sessions-fe-encore-70010000023326'), rdflib.term.Literal('70010000023326'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/fae-farm-P00115'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/mario-kart-8-deluxe-70010000000126'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-pro-controller-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009831'), rdflib.term.Literal('Deze Nintendo Switch-Pro-controller heeft een design dat is geïnspireerd door The Legend of Zelda: Tears of the Kingdom.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/mario-kart-8-deluxe-70010000000126'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-propeller-mario-nintendo-tokyo-exclusive-collection-000000000010004852'), rdflib.term.URIRef('https://store.nintendo.nl/nl/home-and-gifts'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-violet-70010000053972'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/ProductGroup'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/tokyo-mirage-sessions-fe-encore-70010000023326'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/tokyo-mirage-sessions-fe-encore-70010000023326'), rdflib.term.Literal('Twee werelden. Eén heldhaftige roeping.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-luigis-mansion-3-bundel-B00418'), rdflib.term.Literal(\"Deze Nintendo Switch met neonblauwe/neonrode Joy-Con-controllers wordt geleverd met een downloadcode voor Luigi's Mansion 3, plus een Nintendo Switch-hardcase - Deluxe Elite Edition.\"), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-70010000005306'), rdflib.term.Literal('Er bloeit een nieuw avontuur op!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-dream-buffet-sleutelhanger-000000000010010992'), rdflib.term.URIRef('https://store.nintendo.nl/nl/apparel'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/metroid-dread-70010000042925'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html'), rdflib.term.Literal('39.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-70010000058798'), rdflib.term.Literal(\"Kirby's Return to Dream Land Deluxe\"), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396'), rdflib.term.Literal('429.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-violet-70010000053972'), rdflib.term.Literal('70010000053972'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-mario-edition-rood-000000000010011772'), rdflib.term.Literal('000000000010011772'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/ring-fit-adventure-000000000010001992'), rdflib.term.Literal('Ring Fit Adventure is een nieuw soort avonturenspel dat naar Nintendo Switch komt en gebruikmaakt van unieke accessoires die de bewegingen van de speler in de echte wereld detecteren en meten en deze omzetten in acties in het spel.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/monster-hunter-rise-70010000029015'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/monster-hunter-rise-70010000029015'), rdflib.term.Literal('Demo voor de immens grote DLC uitbreiding Sunbreak nu beschikbaar!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirby-speelkaarten-000000000010001931'), rdflib.term.Literal('17.49', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021'), rdflib.term.URIRef('https://store.nintendo.nl/nl/franchises'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-splatoon-3-edition-000000000010009642'), rdflib.term.Literal('Nintendo Switch™ – OLED-Model Splatoon 3 Edition'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-dream-buffet-sleutelhanger-000000000010010992'), rdflib.term.Literal(\"Kirby's Dream Buffet-sleutelhanger\"), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/merchandise'), rdflib.term.URIRef('https://schema.org/ProductGroup'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/animal-crossing-new-horizons-70010000027620'), rdflib.term.Literal('Animal Crossing: New Horizons'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles/nintendo-switch-consoles/nintendo-switch/nintendo-switch-met-neonblauweneonrode-joy-con-controllers-000000000010002207'), rdflib.term.Literal('Nintendo Switch is een baanbrekend spelsysteem voor thuis. Voor het eerst kunnen spelers altijd en overal genieten van een volledige spelsysteemervaring thuis.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/metroid-dread-70010000042925'), rdflib.term.Literal('Metroid Dread'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-party-70010000014063'), rdflib.term.Literal('De Mario Party-serie komt naar het Nintendo Switch-systeem met extreem veel pret voor iedereen!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/animal-crossing-new-horizons-70010000027620'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-bros-wonder-70010000068689'), rdflib.term.Literal('Super Mario Bros. Wonder'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-party-70010000014063'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-neonblauwneonrood-000000000010007455'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-party-70010000014063'), rdflib.term.Literal('70010000014063'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-violet-70010000053972'), rdflib.term.Literal('Pokémon Scarlet en Pokémon Violet, de nieuwste avonturen in de Pokémon-serie, komen op 18 november naar de Nintendo Switch.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-scarlet-70010000053967'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-violet-70010000053972'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106'), rdflib.term.Literal('De Nether-corruptie van de Piglins verspreidt zich over de Bovenwereld en verschroeit alles wat het aanraakt.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-bros-wonder-70010000068689'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/t-shirt-splatoon-3-splatfest-water-P00101'), rdflib.term.URIRef('https://store.nintendo.nl/nl/franchises'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/home-and-gifts'), rdflib.term.URIRef('https://store.nintendo.nl/nl/merchandise'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#subClassOf'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-neonblauwneonrood-000000000010007455'), rdflib.term.Literal('Met de Nintendo Switch – OLED-model kun je altijd en overal genieten van je favoriete games, met een OLED-scherm van 7 inch met levendige kleuren.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-draagtas-000000000010012062'), rdflib.term.Literal('Super Mario-draagtas'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315'), rdflib.term.Literal('0.0', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315'), rdflib.term.Literal('Pikmin 4-theedoek'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-scarlet-70010000053967'), rdflib.term.Literal('Pokémon Scarlet'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-70010000005306'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-splatoon-3-edition-000000000010009642'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-violet-70010000053972'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-propeller-mario-nintendo-tokyo-exclusive-collection-000000000010004852'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirby-speelkaarten-000000000010001931'), rdflib.term.URIRef('https://store.nintendo.nl/nl/home-and-gifts'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-violet-70010000053972'), rdflib.term.Literal('Pokémon Violet'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/triangle-strategy-70010000046321'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-70010000058798'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/uitbreidingspas-fire-emblem-engage-P00102'), rdflib.term.Literal('Uitbreidingspas Fire Emblem Engage'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirby-speelkaarten-000000000010001931'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-rpg-70010000068684'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/shin-megami-tensei-v-P00070'), rdflib.term.Literal('P00070'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/fae-farm-P00115'), rdflib.term.URIRef('https://store.nintendo.nl/nl/new'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/game-boy-posterset-000000000010011600'), rdflib.term.Literal('0.0', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-rpg-70010000068684'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/tokyo-mirage-sessions-fe-encore-70010000023326'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/beenband-000000000010001376'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-dream-buffet-sleutelhanger-000000000010010992'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-legends-arceus-P00045'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-pro-controller-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009831'), rdflib.term.Literal('74.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-64-paperclips-000000000010009889'), rdflib.term.Literal('Nintendo 64-paperclips'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-neonblauwneonrood-000000000010007455'), rdflib.term.Literal('Nintendo Switch - OLED-model (neonblauw/neonrood)'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/game-boy-posterset-000000000010011600'), rdflib.term.Literal('Geef je muren een retro uitstraling met deze Game Boy-posterset met daarop drie klassieke games!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-neonblauwneonrood-000000000010007455'), rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-consoles'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/bravely-default-ii-70010000028618'), rdflib.term.Literal('Bravely Default II'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-pro-controller-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009831'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-000000000010009866'), rdflib.term.Literal('359.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-theedoek-000000000010012315'), rdflib.term.Literal('000000000010012315'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/shin-megami-tensei-v-P00070'), rdflib.term.Literal('Speel in Shin Megami Tensei V als een middelbare scholier die nieuw gevonden krachten moet gebruiken om zich met behulp van een opdrachtensysteem door een met demonen besmette woestenij te vechten._x000D_\\r\\n'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles/nintendo-switch-consoles/nintendo-switch/nintendo-switch-met-neonblauweneonrode-joy-con-controllers-000000000010002207'), rdflib.term.Literal('299.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/splatoon-3-70010000046396'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/minecraft-legends-deluxe-edition-P00106'), rdflib.term.Literal('P00106'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/xenoblade-chronicles-3-70010000053337'), rdflib.term.Literal('\"Vechten om te leven... en leven om te vechten.\"_x000D_\\r\\nBestel en ontvang een GRATIS notitieboekje (zolang de voorraad strekt)._x000D_\\r\\n'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-neonblauwneonrood-luigis-mansion-3-bundel-B00418'), rdflib.term.Literal('B00418'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/another-code-recollection-70010000072197'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021'), rdflib.term.Literal('70010000005021'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-muismat-000000000010011641'), rdflib.term.URIRef('https://store.nintendo.nl/nl/franchises'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/gamestudio-P00075'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-64-paperclips-000000000010009889'), rdflib.term.Literal('000000000010009889'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pokemon-legends-arceus-P00045'), rdflib.term.Literal('Pokémon Legends: Arceus'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/another-code-recollection-70010000072197'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/pikmin-4-70010000005306'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/princess-peach-showtime-70010000005021'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396'), rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-bundles'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/another-code-recollection-70010000072197'), rdflib.term.Literal('Beleef het volledige verhaal van Ashley Mizuki Robbins in twee avonturen in Another Code: Recollection'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-splatoon-3-edition-000000000010009642'), rdflib.term.Literal('359.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396'), rdflib.term.URIRef('https://store.nintendo.nl/nl/franchises'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/beenband-000000000010001376'), rdflib.term.Literal('000000000010001376'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-neonblauwneonrood-000000000010007455'), rdflib.term.Literal('349.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-pokemon-scarlet-and-violet-edition-000000000010009862'), rdflib.term.Literal('000000000010009862'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-propeller-mario-nintendo-tokyo-exclusive-collection-000000000010004852'), rdflib.term.Literal('Knuffel Propeller-Mario – Nintendo Tokyo Exclusive Collection'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/shin-megami-tensei-v-P00070'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/fae-farm-P00115'), rdflib.term.Literal('Maak, cultiveer en versier om je gedeelde woning te laten groeien en gebruik spreuken om het betoverde eiland Azoria te verkennen!'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-10-kazuya-P00073'), rdflib.term.Literal('5.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html'), rdflib.term.URIRef('https://store.nintendo.nl/nl/new'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/metroid-dread-70010000042925'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-oled-model-the-legend-of-zelda-tears-of-the-kingdom-edition-the-legend-of-zelda-tears-of-the-kingdom-bundel-B00396'), rdflib.term.Literal('Deze systeembundel bevat de Nintendo Switch – OLED-model The Legend of Zelda: Tears of the Kingdom Edition, de game The Legend of Zelda: Tears of the Kingdom, en een Nintendo Switch-hardcase - Deluxe Elite Edition.'), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/nintendo-switch-sports-P00086'), rdflib.term.Literal('Nintendo Switch Sports'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/https://www.nintendo.nl/Games/Nintendo-Switch-games/Metroid-Prime-Remastered-2341668.html'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles/nintendo-switch-consoles/nintendo-switch/nintendo-switch-met-neonblauweneonrode-joy-con-controllers-000000000010002207'), rdflib.term.Literal('Nintendo Switch met neonblauwe/neonrode Joy-Con-controllers'), rdflib.term.URIRef('https://schema.org/name'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-70010000058798'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-rpg-70010000068684'), rdflib.term.Literal('70010000068684'), rdflib.term.URIRef('https://schema.org/sku'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/consoles/nintendo-switch-consoles/nintendo-switch/nintendo-switch-met-neonblauweneonrode-joy-con-controllers-000000000010002207'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-70010000058798'), rdflib.term.Literal('59.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/uitbreidingspas-fire-emblem-engage-P00102'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/knuffel-propeller-mario-nintendo-tokyo-exclusive-collection-000000000010004852'), rdflib.term.Literal('24.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/monster-hunter-rise-70010000029015'), rdflib.term.Literal('39.99', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#double')), rdflib.term.URIRef('https://schema.org/price'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/kirbys-return-to-dream-land-deluxe-70010000058798'), rdflib.term.Literal(\"Er komt een luxe versie van Kirby's Adventure Wii!\"), rdflib.term.URIRef('https://schema.org/description'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/super-mario-party-70010000014063'), rdflib.term.Literal('Nintendo'), rdflib.term.URIRef('https://schema.org/brand'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/xenoblade-chronicles-3-70010000053337'), rdflib.term.URIRef('https://schema.org/Product'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'))\n",
      "(rdflib.term.URIRef('https://store.nintendo.nl/nl/challenger-pack-van-min-min-70050000018967'), rdflib.term.URIRef('https://store.nintendo.nl/nl/games'), rdflib.term.URIRef('https://schema.org/item'))\n"
     ]
    }
   ],
   "source": [
    "# Check the full graph: for checking only\n",
    "query = \"\"\"\n",
    "SELECT * WHERE {\n",
    "  ?s ?p ?o\n",
    "}\n",
    "\"\"\"\n",
    "results = graph.query(query)\n",
    "for row in results:\n",
    "    print(row)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.17"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
